1. Navigate to http://[Target IP]:8000, open the "Search & Reporting" application, and find through an SPL search against all data the account name with the highest amount of Kerberos authentication ticket requests. Enter it as your answer:

index=* EventCode=4768
| stats count by Account_Name
| sort - count
| head 1

2. Navigate to http://[Target IP]:8000, open the "Search & Reporting" application, and find through an SPL search against all 4624 events the count of distinct computers accessed by the account name SYSTEM. Enter it as your answer.

index=* EventCode=4624 Account_Name=SYSTEM
| stats distinct_count By ComputerName
| sort - count

3. Navigate to http://[Target IP]:8000, open the "Search & Reporting" application, and find through an SPL search against all 4624 events the account name that made the most login attempts within a span of 10 minutes. Enter it as your answer.

index=* EventCode=4624
| stats min(_time) as first_login, max(_time) as last_login, count as login_attempts by Account_Name
| eval time_range = last_login - first_login
| where time_range <= 600
| sort - login_attempts
| table Account_Name, login_attempts
